A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fasion in rows and columns.

# List -> DataFrame

In [1]:
import pandas as pd

In [2]:
data = [1, 2, 3, 4, 5]

In [3]:
df = pd.DataFrame(data)

In [4]:
df

   0
0  1
1  2
2  3
3  4
4  5

In [5]:
data = [["Alex", 10], ["Bob", 12], ["Clarke", 13]]

In [6]:
df = pd.DataFrame(data, columns=["Name", "Age"])

In [7]:
df

     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   13

In [8]:
data = [["Alex", 10, True], ["Bob", 12, False], ["Clarke", 13, True]]

df = pd.DataFrame(data, columns=["Name", "Age", "Female"])

df

     Name  Age  Female
0    Alex   10    True
1     Bob   12   False
2  Clarke   13    True

# Dictionary -> DataFrame

```python
dict = {key: value}
```

key를 넣어줬을 때 Value를 얻는 이러한 자료구조를 -> Dictionary

Value를 넣어줬을 때 Key를 얻을 수는 없을까? -> Dictionary는 이것이 안됨.

In [9]:
data = {"Name": ["Tom", "Jack", "Steve", "Ricky"], "Age": [28, 34, 25, 24]}

In [10]:
df = pd.DataFrame(data)

In [11]:
df

    Name  Age
0    Tom   28
1   Jack   34
2  Steve   25
3  Ricky   24

In [12]:
df = pd.DataFrame(data, index=["rank1", "rank2", "rank3", "rank4"])

In [13]:
df

        Name  Age
rank1    Tom   28
rank2   Jack   34
rank3  Steve   25
rank4  Ricky   24

# Column Selection

In [14]:
import pandas as pd

In [15]:
data = {"Name": ["Tom", "Jack", "Steve", "Ricky"], "Age": [28, 34, 25, 24]}

In [16]:
df = pd.DataFrame(data)

In [17]:
df

    Name  Age
0    Tom   28
1   Jack   34
2  Steve   25
3  Ricky   24

In [18]:
df['Name']

0      Tom
1     Jack
2    Steve
3    Ricky
Name: Name, dtype: object

In [19]:
df['Age']

0    28
1    34
2    25
3    24
Name: Age, dtype: int64

# Column Addition

* Pandas Series -> 1차원

* Pandas DataFrame -> 2차원

In [20]:
df

    Name  Age
0    Tom   28
1   Jack   34
2  Steve   25
3  Ricky   24

In [21]:
df["Female"] = pd.Series([False, False, True, True])

In [22]:
df

    Name  Age  Female
0    Tom   28   False
1   Jack   34   False
2  Steve   25    True
3  Ricky   24    True

In [23]:
df["Age2"] = pd.Series([10, 12, 15, 13])

In [24]:
df

    Name  Age  Female  Age2
0    Tom   28   False    10
1   Jack   34   False    12
2  Steve   25    True    15
3  Ricky   24    True    13

In [25]:
df["Age Sum"] = df["Age"] + df["Age2"]

In [26]:
df

    Name  Age  Female  Age2  Age Sum
0    Tom   28   False    10       38
1   Jack   34   False    12       46
2  Steve   25    True    15       40
3  Ricky   24    True    13       37

# Column Deletion

In [27]:
df

    Name  Age  Female  Age2  Age Sum
0    Tom   28   False    10       38
1   Jack   34   False    12       46
2  Steve   25    True    15       40
3  Ricky   24    True    13       37

In [28]:
# del df["Age Sum"]

In [29]:
# df

In [30]:
df["Age_Sum"] = df.pop('Age Sum')

```pop```: Deletion + Fetching

In [31]:
df

    Name  Age  Female  Age2  Age_Sum
0    Tom   28   False    10       38
1   Jack   34   False    12       46
2  Steve   25    True    15       40
3  Ricky   24    True    13       37

# Row Selection, Addition, and Deletion

In [32]:
data = {"Name": ["Tom", "Jack", "Steve", "Ricky"], "Age": [28, 34, 25, 24]}

In [33]:
df = pd.DataFrame(data, index=["a", "b", "c", "d"])

In [34]:
df

    Name  Age
a    Tom   28
b   Jack   34
c  Steve   25
d  Ricky   24

In [35]:
df.loc['b']

Name    Jack
Age       34
Name: b, dtype: object

# Index

In [36]:
df.iloc[1]

Name    Jack
Age       34
Name: b, dtype: object

# Slice Rows

In [37]:
df.iloc[1:3]

    Name  Age
b   Jack   34
c  Steve   25

# Addition of Rows

In [38]:
import pandas as pd

In [54]:
df = pd.DataFrame([[1, 2], [3, 4]], columns = ['a', 'b'])
df2 = pd.DataFrame([[5, 6], [7, 8]], columns = ['a', 'b'])

In [55]:
df = df.append(df2)

/tmp/ipykernel_124216/948459739.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(df2)

In [56]:
df

   a  b
0  1  2
1  3  4
0  5  6
1  7  8

In [57]:
df.iloc[1:4] # 1에서 3 인덱스까지 보여준다

   a  b
1  3  4
0  5  6
1  7  8

In [43]:
df.loc[0]

   a  b
0  1  2
0  5  6

In [44]:
df = df.drop(0)

In [45]:
df

   a  b
1  3  4
1  7  8

In [ ]:
data = {'name':['a', 'b', 'c', 'd', 'e'], 
      'age': [1, 2, 3, 4, 5]}
df = pd.DataFrame(data)

df = df.drop(df[df['age'] == 3].index)